app/Models/tbllotes.php

    public function datalotesTotales(){
        $builder=$this->db->table('tbllotes');
        $builder->select('tbllotes.id_lote,tbllotes.numero_lote,tbllotes.cantidaCerdos,tbllotes.fechaCreacion,tblusuarios.nombre,tblusuarios.apellido,tblusuarios.perfil,tblusuarios.documento,tblusuarios.telefono,tblusuarios.correo');
        $builder->join('tblusuarios','tblusuarios.idUser=tbllotes.usuarioCreador');
        $sumaPesoCerdos= $builder->get()->getResultArray();
---
SELECT `tbllotes`.`id_lote`, `tbllotes`.`numero_lote`, `tbllotes`.`cantidaCerdos`, `tbllotes`.`fechaCreacion`, `tblusuarios`.`nombre`, `tblusuarios`.`apellido`, `tblusuarios`.`perfil`
FROM `tbllotes`
JOIN `tblusuarios` ON `tblusuarios`.`idUser`=`tbllotes`.`usuarioCreador`