app/Models/tblrasaspuercos.php

SELECT *
FROM `tblrasaspuercos`
---
    public function totalRazas(){
        $data=$this->db->table('tblrasaspuercos')->get()->getResultArray();